{
  "about/contacts.md": "**I am going to list my contact information in the order of reachability. A Twitter DM is much more effective than amateur radio, but I keep your options open. So, here you go:** **Twitter/X DM:** [ @OngDevLab](https://www.twitter.com/ongdevlab) **Cell Phone:** +1(630)703-8208 **E-mail:** [ongdevlab@gmail.com](mailto:ongdevlab@gmail.com) **TikTok:** [@will.ong](https://www.tiktok.com/@will.ong) **Amateur Radio:** Callsign: KD9OKJ, hit the Cincinnati repeater, 7.175-7.3MHz Band, and have telepathy to know when I am on my radio.",
  "about/experience.md": "This reference serves as a quick summary of my experience. Long story short, I have had experience in the following focus areas: - ML Engineering - Sales/Design/Social Media Management - Data Science - Software Development I have also worked in multiple different environments: - Remote - Production facilities - Fortune 500 - Government - Startups - Overseas - Contract & Full Time As a result, I have a relatively wide toolkit I rely on to solve your organization's needs. If you are interested in speaking with me in greater detail, please check out my [contacts page](./../contacts/) ## Further reading - I have split my docs into a career and projects section. - The career section highlights a select few software related roles and the corresponding responsibilities. - The projects section highlights my personal projects that had high software involvement.",
  "career/contracting.md": "I have done contracting roles since 2010 in various industries, roles, and responsibilities. As my skillset grows, I often take on contracts to gain further experience in new spaces, while offering my clients a unique blend of having a diverse toolkit and high adaptability. Below are the types of roles I have taken, with company names listed based on the type of disclosure agreement: ## Contracting Roles, Responsibilities, and Results: - **Developer Advocate:** I had a contracting role where I managed growth and signups at a startup. In this role, I developed an effective twitter growth strategy, had the highest daily signups during my time in role, and wrote guides and technical documentation. The technical documentation consisted of connection guides in node.js, python, go, postgres, rails, etc. In addition, I wrote guides on the Kubernetes operator. See [Tembo](./../tembo/) for more details. - **TikTok Growth Consulting:** I've had various roles with TikTok account growth. This started primarily in 2021, where I began to do TikTok consulting with P&G internally. Eventually, since I was actually in the engineering division at the time, I had to lower my time allotment to TikTok consulting in P&G. I, however, still enjoyed TikTok consulting, so I began to take on clients for brand deals on videos and TikTok strategy. See [TikTok](./../../projects/tiktok/) for more details. - **Data Science/ML for Finance:** I had a role where I served as an R&D data scientist overseas in a large Singapore bank. I provided consulting on new data models and machine learning algorithms that could help the business. I also wrote some MVP projects for their teams. This company chose not to disclose their name. - **RF Design Engineering:** I had a contract to design radiated emmissions mitigation hardware for EU CE compliance for a large US computer manufacturer. My responsibilities included performing the standard tests on the VNA and S parameter analysis, electromagnetic FEM modeling, and the hardware design to mitigate the emissions. This company made me sign a lengthy NDA, so I'm not disclosing their name. - **Direct Sales and Marketing:** I saw a gap in my skillset at one point in my career: sales. I wanted to gain valuable experience in sales and marketing, so I ended up taking a short term assignment at Vector Marketing, a subsidiary of Alcas Corporation, that manufactures Cutco knives. In my time at the company, I was ranked in the top 15 highest performing salesmen. See [Cutco](./../cutco/) for more details. - **Real Estate:** I began my career in 2010, helping with the family real estate business. My focus was mainly on the backend, where I handled analytics and tracked the performance of our marketing campaigns. In addition, I also had responsibilities for door-to-door advertising, where I A/B tested multiple flyer types and advertising vectors. In addition, I designed all the signage and digital assets for the business. See [Real Estate](./../realestate/) for more details. ## Skills Utilized: - **Inbound/Outbound Sales:** My contracting roles came primarily from having a solid roles pipeline. You may be reading this if you are interested in hiring me! - **Data Science:** During most of my contract roles, I often rely heavily on my data science skillset. It's one of my strongest expertise areas and my clients often cite my combination of data science with a behavioral science tilt as a winning combination. - **Design(Software, Hardware, 2D):** My roles often extend into integration roles. I work with multi-function teams and startups, so my understanding of software, electronic hardware, engineering, and 2D graphic design result in clear communication between clients and their stakeholders when using my software and MVP products. ## Tech Stack The four P's: - **Perseverence** - **People Skills** - **Patience** - **Pomodoro Technique**",
  "career/cutco.md": "I wanted to get better at in-person sales. I found a quick short term contract to learn the ropes of sales. Eventually, I ranked as one of the top 15 salespeople in the US. I still use the strategies I learned in the trainings to this day. ## These were my three strategies - **Sell to who you know:** Selling is much simpler when you have a connection. This strategy landed my initial clients. - **Give Good Deals==Get Referrals:** I had the cheapest prices compared to my peers. I had negotiated higher volume, which took a small hit to my profits, but I could drive quadruple the customers, as word would spread about my lower prices. - **Understand the Market:** I sold to mainly the Asian community, as I have a good grasp of the market. In addition, I had a better grasp of our culture and traditions, so I could easily relate and provide multiple use cases with greater impact. # Skills Utilized: - **Sales:** I utilized a battle-tested sales manual combined with my understanding of my market to deliver enhanced results. - **Market Analytics:** Understanding the market and collecting data to test my findings resulted in my strategy. ## Tech Stack - **Cutco Sales Manual** - **Every School Directory I Owned** - **Phonebooks** - **Excel** - **Caffeine**",
  "career/daman.md": "I am currently a Senior Consultant at Daman Consulting, Inc. My focus is ML engineering and AI engineering, with an emphasis on designing secure and scalable production AI architectures and implementations. My main client is the Texas Department of Transportation (TxDOT). ## I have selected a few key milestones for the current project: - **Value Projection:** I had the responsibility of calculating and identifying key areas of value for the TxDOT AI POC. From estimates derived from real data samples in our pipeline, I had calculated a value projection of ~$100,000/month in savings in productivity from the AI effort. - **ML Engineering Pipeline POC:** For a preliminary demo for stakeholders, I had the responsbility of implementing a simplified LLM RAG Pipeline stack hosted on AWS. I leveraged built-in AWS ML features, such as Amazon Bedrock. - **Secure Network Architecture:** After the demo, I delivered a secure network architecture diagram for the scalable AI product to ensure adherence to all data governance checks. - **EDA and Hybrid Classical ML/Transformer Analysis:** Once we had gotten the architecture approved, we had access to real data. I combined LLMs and Transformers in conjunction with classical ML models (regression, etc.) to provide insights from our data. - **LLM RAG Pipeline Development:** After the preliminary analysis, I implemented the RAG pipeline and LLM prompt testing frameworks that will be ready for production workloads. We primarily used Amazon Bedrock for the LLM's and Postgres with pgVector for the vector database. ## Skills Utilized: - **ML Engineering:** I have had the opportunity to work on all aspects of ML engineering in this role. I have delivered EDA using classical ML techniques, and delivered production pipelines that leverage the latest LLM platforms and technologies. - **Secure Architecture:** As I came in very early in the project lifecycle, I had more involvement in architecture design decisions. This opportunity allowed me to leverage my passion cybersecurity to deliver a secure and compliant network architecture design with all appropriate routes, SCP's, and business-defined policies accounted for. - **Data Lakehouse/Database Design and Administration:** In addition to the ML engineering aspects, I also built out classic data engineering pipelines and implemented best-practice database design when implementing the underlying data layer serving the LLM's and auxiliary API's. ## Tech Stack - **AWS Fargate** - **Amazon Bedrock** - **Amazon Aurora** - **pgVector** - **Snowflake** - **Streamlit** - **Spark** - **AWS Glue** - **pyTorch** - **Splunk**",
  "career/pg.md": "I worked at Proctor and Gamble in the engineering divison, but had responsibilities in Brand, R&D, and IT. After my TikTok had started to climb past the sizes of all the other P&G TikTok accounts, the brand divisions took notice. In addition, I had a teaching role which resulted in over 150 citizen developers trained. In total, my efforts delivered over $45 million in value. ## I have selected a few notable projects: - **Data Science and Data Engineering Tutoring Program:** I created a tutoring program where any division working on any brand could get my programming support. Not only did my students get trained in Databricks and SQL, but since I made the projects interactive and based on their current work, the tutoring became full automation projects. In total, from tutoring, we delivered 100+ automation projects, each with an average savings value of ~$500k. - **Manufacturing Data Search Engine:** When working in the plants, I had noticed a deep disconnect between the machine operators and the data scientists analyzing the machine. I sought to build a piece of software to bridge the gap. As a result, I built the MVP for and led an 8 person team to deliver a manufacturing data search engine for the entire company. The tool is projected to save P&G around $16 million a year. - **Audio Classification AI:** After winning the P&G 2023 Deep Learning Hackathon, I had the opportunity to scale the tool to the US and Europe. In addition I had a team of three developers that worked with me to build a hardware device to track shaving usage. The AI reached an F1 score of 97% and held even with new data. - **TikTok Consulting:** I had developed a TikTok optimization software over a few weekends, and the system started to make us go viral with over 2 million followers. Eventually, P&G top brass took notice and had me consult and aid in TikTok strategy for the entire Swiffer brand. We analyzed thousands of TikTok's and developed a repeatable and captivating strategy for the brand. ## Skills Utilized: - **Navigating Corporate Environments:** I took some time learning the ropes as an employee, but I finally found a niche I enjoyed. Ironically, after learning what I liked in terms of work, I went back to contracting! However, now, I am equipped with the ability to traverse large organizations from the outside. - **Python:** 95% of my work was done in Python building data pipelines. I love doing the flashy machine learning model, but the reality is these large companies have so many issues that just need one big pandas function. - **Managing Expectations:** Often, corporate clients prefer a soft sell with solid data backing. In addition, some of this data would get skewed in the media. It is a fine-line skill to manage an executive's expectations of new technology. ## Tech Stack: - **Python/Tensorflow** - **Databricks** - **F# Safe Stack** - **Excel** - **Power BI**",
  "career/realestate.md": "This is where I started learning the basics of marketing and data science. I have always had a fascination about statistics and marketing, and I believe this curiosity started from when our family figured out how to scale the business to multiple six figures. ## Here's three keys to our success: - **Outreach and Lead Generation:** We developed a referral-based lead generation approach. We used no Zillow or other lead services. We organically generated leads through referrals and a recently-neglected strategy: door-to-door sales. I was responsible for designing the flyers in Adobe Illustrator. We came to this conclusion by A/B testing the market! - **Low Fees, High Volume:** We charged lower fees than over 95% of all agent teams, yet we were top performers year-after-year. We focused on the low fees, but had compensated with over triple the volume. - **Customer Service:** This was the cornerstone of our strategy. Good customer service resulted in a consistent and growing stream of referrals that converted higher than alternative lead generating paid tools. ## Skills Utilized: - **Physical Fitness:** When doing the door-to-door portion of our strategy, we had to walk over 20,000 steps a day. This resulted in conditioning required to keep our muscles functioning. - **A/B testing:** Marketing relies heavily on A/B tests. This testing allowed us to outperform the market with strategies that many overlooked. - **Data Science:** When testing for optimal strategies, having the data science background often aided in designing the experiments and executing the assignments. ## Tech Stack: - **Sunscreen** - **an Ear-to-Ear Smile** - **Excel** - **Family** - **Adobe Illlustrator**",
  "career/tembo.md": "How I got this contract role is a very fun story! Set up a conference call with me if you are interested in hearing it! I joined Tembo for a role because of two aspects: Open Source and Databases. Tembo had both, as an open source Postgres extensions company. I had done many data science contracts in the past, and wanted more experience in data engineering and developer advocacy. ## These were my responsibilities: - **Outreach and Lead Generation:** I tested multiple lead generating strategies, including outreach with the mayor of Cincinnati, going to conferences, meeting small businesses, connecting with old P&G colleagues, and finally what worked best: Twitter Growth. - **Write Guides and Documentation:** I have a programming background, so instead of completely focusing on writing copy, I had another aspect where I wrote guides for using the open source Kubernetes Operator and writing connection guides to and from Postgres to various programming languages. You can see my contributions in my Github. - **Market Analysis:** I did have the opportunity to utilize some data science in my role. I was able to segment the market with clustering and build specific marketing strategies for different target niches. ## Skills Utilized: - **Web Development:** I had much greater focus in coding while writing the guides. Through the guide writing, I became far more interested in web development and began to understand the inner workings of the web. - **Cloud-native Kubernetes:** Since I was communicating and writing guides for enterprise clients regarding on-prem use of the Kubernetes operator, I had to take a deep dive on k8s on the big three clouds providers: GCP GKE, Azure AKS, AWS EKS. - **Developer Marketing:** My core role was marketing and driving signups. During my contract, I had posted the highest signup numbers (the main success metric) and aided in multiple in-flight deals and partnerships with companies such as FerretDB (Postgres Open Source MongoDB alternative). ## Tech Stack: - **Kubernetes** - **AWS/GCP/Azure** - **Twitter** - **NextJS/Docusaurus**",
  "career/tutoring.md": "One of my greatest passions is teaching and presenting information in entertaining ways. Throughout my career, I have tutored engineers, developers, saxophonists, artists, and everyone in between! ## I have selected two notable roles: - **Data Science/Data Engineering Tutoring:** After completing my data engineering certificate from Databricks, I was tapped to lead P&G's corporate engineering division's data science and data engineering upskilling effort. In the end, I had tutored directly over 150 citizen developers, with representation in all business units and business functions. Management had concluded that the effort saved P&G over $30 million directly from my efforts. - **Electrical Engineering Tutoring:** I tutored over 1,000 students in classes such as Circuits, Advanced Circuits, Electromagnetics, Calculus, Differential Equations, etc. As a result, many students had their exam grades improve! ## Skills Utilized: - **Teaching:** Tutoring groups and individuals requires a keen understanding of how students learn and retain information. I spent hours figuring out the best research and science-based strategies to keep my students captivated enough to learn effectively. I utilized project-based learning, pomodoro, and interactive visual aids. - **Technical Communication:** Communicating concisely is key to helping students understand the basics. Most of the time, I was teaching first time programmers and hardware designers, so putting myself in their shoes proved effective. - **Technical Flexibility:** Many self-help books will teach you to help someone where they are at. Having a flexible and wide technical skillset has saved me multiple times when I had to explain an abstract technical concept to someone completely out of the field of study where I taught my class. ## Tech Stack: - **Databricks SQL/Python** - **JupyterLab** - **ChatGPT** - **Patience** - **Power BI** - **Altera Quartus II** - **Cyclone FPGA**",
  "index.mdx": "import { Card, CardGrid } from '@astrojs/starlight/components'; ## This is Me, At a Glance: Large-Language Models Manufacturing Systems Financial Modeling Computer Vision IoT and Audio TikTok Virality Twitter/X Growth Affiliate Marketing Hubspot CRM Data Pipelines/Data Engineering Cloud Computing Developer Advocacy Writing guides that your startup doesn't want to write ### Key Tools: Python/SQL Llama/GPT/Mistral Databricks Notebooks/JupyterLab Tensorflow/PyTorch R Studio JMP Script C++/Arduino C F#/C#/VBA Astro Starlight HTML/CSS/JS TikTok Twitter/X Hubspot The Trade Desk SocialBlade Reddit Google Analytics Nielsen Gartner Bloomberg Terminal OngDevLab Custom Tooling",
  "projects/audioml.md": "Every year, P&G held a hackathon where the top data scientists in P&G would compete in a machine learning task. In 2023, the task was to classify audio samples as running water or noise. This is useful for behavioral research studies and sustainability studies. The competition consisted of over 100 participating data scientists. I came in first place overall. ## The process I used to win the hackathon: - **Clean Training Data:** The data provided had many artifacts and misclassifications. I manually combed the data and created a filtering function to remove incorrect samples. I also recorded my own sample data to enhance my training dataset. - **Physics:** Since the data was for detecting when a person would open or shut off a faucet, I timed and calculated the rise time for the action, resulting in having the optimal window size for my audio samples. - **Using the full depth of data available:** The standard approach to audio classification was to bucket data into small samples, and doing a grid search of different frequency bands and building a simple classifier. Instead of this approach, I used the VGG19 transfer learning image classifier and used the mel spectrogram audio representation (this is the thumbnail image) and fed that result into the classifier. The spectrogram allowed for time and frequency representations to be represented in the data. - **Big, Big Supercomputer:** Since I was a Kubernetes admin for the cluster, I had access to over three V100 GPU's and eight T4 GPU's. With this compute power, I was able to run and build my model in a weekend. - **Tuned Mass Damper inspired Mean Smoothing:** I had used traditional mean smoothing techniques, but kept seeing the smoothing fail in a predictable way. After seeing the pattern of the fails, I realized that the failure looked like the graph of a tuned mass damper equation from my engineering days. After implementing the function, the smoothing improved my classification by five percent. - **The Results:** 97% F1 Score, over 10% gap in accuracy compared to runner up. ## Skills Utilized: - **Data Science:** This project had many components of the data science workflow. I had to do the data cleaning and acquisition, find domain expertise, build the best suited model, and filter the output noise. - **Communication and Collaboration:** During the hackathon, I had to find many experts from inside the company and from external resources. In addition, I had to then take a tour at the end of competition to present to various executives in the company. - **Digital Signal Processing:** Having experience in electrical engineering and DSP (Digital Signal Processing) gave me a leg up in the competition. Understanding the reasoning behind not compressing to mp3, building fourier transforms, and other filtering tricks allowed me to focus my time on the ML/AI tasks at hand and not on the basic theory. ## Tech Stack: - **Python/Pandas** - **Tensorflow/Keras** - **Excel/PowerPoint** - **Supercomputer** - **Managing Expectations**",
  "projects/tiktok.md": "I started a data science experiment in 2019 trying to reapply what I learned about EDA and data science from my work to the areas of Social Media. After leveraging classifiers and sentiment analysis algorithms, my team had figured out how to generate around 3 billion views a year and 2,000,000+ followers on TikTok, repeatable across multiple accounts. ## We focus on three types of accounts: - **Flagship Production Account:** This is the main account. All our testing and ancillary TikTok accounts feed into this account. We try to not have a focus or niche in this account. The focus is pure growth and impressions. Check out our main account: [@will.ong](https://www.tiktok.com/@will.ong) - **Niche Production Account:** This account type focuses on a specific niche and is targeted to a specific persona. For example, we have an account devoted only to makeup. This niche style account allows to achieve greater community engagement. Check out a niche account here: [@poissonofficial](https://www.tiktok.com/@poissonofficial) - **Development Account:** This account type is a pure experimental account. This account can stay idle for months until we decide to run a experiment to test out changes in the algorithm. We have both unmonetized and monetized accounts to test growth rates. This accouht type is essentially our R&D department. Here is a development account: [@alexong68](https://www.tiktok.com/@alexong68) ## Skills Utilized: - **Social Media Management:** Leveraged understanding of TikTok trends and broad social trends to create videos that went viral. - **Data Science:** Built Tensorflow Models and statistical/econometric models to predict and find content creation strategies that had high success and repeatability. - **Content Creation:** Learned industry standard software, such as CapCut and Final Cut Pro to create content that had visual appeal. ## Tech Stack: - **Python** - **Tensorflow/Keras** - **TikTok** - **Streamlit**",
  "projects/twitter.md": "The focus of my Twitter growth project was to cultivate a community of tech enthusiasts through memes, developer experience, and fun NFTs! This started when I was in a growth role on contract at a startup. I was primarily hired for my TikTok experience, but quickly learned that most tech movers and shakers focused on Twitter more. Thus, I used the tactics I learned from TikTok to build out and monetize a Twitter account in three months, with 9,000 followers in tech and over 10 million impressions. Check out the account here: [@OngDevLab](https://www.twitter.com/ongdevlab) ## I focused on three key growth vectors: - **Authority Content:** This has proven to be the most effective content. Authority content, or content that shows my expertise in certain fields helps with organic growth. These posts tend to have the best engagement percentage. - **Comedy Content/Memes:** Creating comedic relatable developer content garners the highest viewcounts on my tweets. These tweets allow me to reach new audiences and increase my funnel of followers engaging with my content. Also, it's great to help bring a smile to a developer's face! - **Content that just plain works:** Sometimes, there is a tweet I see in and out of my niche that just plain works well for engagement and comedy. I make note of these tweets and can often recycle them every few months or so. This provides interaction and discussion between my audience. ## Skills Utilized: - **Software Development:** Since I decided to niche my Twitter to the developer community, I've had many opportunities to showcase my expertise in software development for data scientists. - **Data Science:** Because of my experience on TikTok, I was able to reuse many of my sentiment analysis models and build new models. Since Twitter gives you an analytics download, I was able to use more statistical methods as well. - **Behavioral Science:** Creating entertaining content daily requires constant use of improvisation skills and understanding of human behavior. The algorithm wants engagement, so nudging users to engage with my content is an ongoing R&D task. ## Tech Stack: - **Python/Pandas** - **Tensorflow/Keras** - **Twitter** - **HTML/CSS/JS**",
  "test_file.md": "This is a test file. Its content should also be ingested by the script."
}